tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "sidneys/homebrew"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Download with resuming and segmented downloading
brew "aria2"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Configurable talking characters in ASCII art
brew "cowsay"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Let's Encrypt client and ACME library
brew "lego"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Rainbows and unicorns in your console!
brew "lolcat"
# Mac App Store command-line interface
brew "mas"
# Fast, highly customisable system info script
brew "neofetch"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Oracle Cloud Infrastructure CLI
brew "oci-cli"
# Monitor data's progress through a pipe
brew "pv"
# Password generator
brew "pwgen"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Emulator for x86 and PowerPC
brew "qemu"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Implementation of SHA-256, SHA-384, and SHA-512 hash algorithms
brew "sha2"
# Work with remote images registries
brew "skopeo"
# High-performance, platform-neutral implementation of VNC
brew "tiger-vnc"
# Terminal multiplexer
brew "tmux"
# Command-line tool for Vultr
brew "vultr"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Homebrew, but with Docker images
brew "whalebrew"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
# Corporate typeface for IBM
cask "font-ibm-plex"
cask "font-source-code-pro"
# Desktop client for GitHub repositories
cask "github"
# GPU-based terminal emulator
cask "kitty"
# Instant messaging application focusing on security
cask "signal"
cask "transmission-remote-gui"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multi-platform graphical interface for official Nmap Security Scanner
cask "zenmap"
mas "1Password 7", id: 1333542190
mas "Apple Configurator", id: 1037126344
mas "DaisyDisk", id: 411643860
mas "FileZilla Pro", id: 1298486723
mas "Kindle", id: 405399194
mas "Microsoft Remote Desktop", id: 1295203466
mas "Monal", id: 1637078500
mas "OmniGraffle", id: 1142578753
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "Twitter", id: 409789998
mas "WhatsApp", id: 1147396723
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
